; domain
(define (domain pacman)

    (:requirements :strips :disjunctive-preconditions :typing :conditional-effects :negative-preconditions)

    (:types
        posicao
    )

    (:predicates
        ; Predicados de Localização
        (pacman-em ?px ?py - posicao)
        (fantasmaR-em ?px ?py - posicao)
        (fantasmaG-em ?px ?py - posicao)
        (fantasmaB-em ?px ?py - posicao)
        (frutaR-em ?px ?py - posicao)
        (frutaG-em ?px ?py - posicao)
        (frutaB-em ?px ?py - posicao)
        (parede-em ?px ?py - posicao)

        ; Predicados de liberação
        (pacman-liberado)
        (fantasmaR-liberado)
        (fantasmaG-liberado)
        (fantasmaB-liberado)

        ; Predicados de Direção do Fantasma Azul:
        (fantasmaB-up)
        (fantasmaB-right)
        (fantasmaB-down)
        (fantasmaB-left)

        ; Predicados de Direção do Fantasma Verde:
        (fantasmaG-up)
        (fantasmaG-right)
        (fantasmaG-down)
        (fantasmaG-left)

        ; Predicados de Direção do Fantasma Vermelho:
        (fantasmaR-up)
        (fantasmaR-right)
        (fantasmaR-down)
        (fantasmaR-left)

        ; Predicados de Checagem de Morte:
        (checar-morto-pre)
        (checar-morto-pos)

        ; Predicados de Incremento/Decremento:
        (inc ?x ?xn)
        (dec ?x ?xn)

        ; Predicados frutas:
        (frutaR-ativa)
        (frutaG-ativa)
        (frutaB-ativa)

        ; Predicados de finalização
        (fantasmaR-morto)
        (fantasmaG-morto)
        (fantasmaB-morto)
        (pacman-morto)
    )

    (:action checagem-morto-pre
        :parameters (?px ?py - posicao)
        :precondition (and (checar-morto-pre) (pacman-em ?px ?py))
        :effect (and
            (when
                (or
                    (and (pacman-em ?px ?py) (fantasmaR-em ?px ?py))
                    (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py))
                    (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py))
                )
                (pacman-morto)
            )
            (not(checar-morto-pre))
            (fantasmaR-liberado)
            (when
                (and (pacman-em ?px ?py) (frutaR-em ?px ?py))
                (and (frutaR-ativa) (not(frutaB-ativa))))
            (when
                (and (pacman-em ?px ?py) (frutaB-em ?px ?py))
                (and (frutaB-ativa) (not(frutaR-ativa))))
        )
    )

    (:action checagem-morto-pos
        :parameters (?px ?py - posicao)
        :precondition (and (or(checar-morto-pos)(fantasmaB-morto)) (pacman-em ?px ?py))
        :effect (and
            (when
                (or
                    (and (pacman-em ?px ?py) (fantasmaR-em ?px ?py))
                    (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py))
                    (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py))
                )
                (pacman-morto)
            )
            (not(checar-morto-pos))
            (pacman-liberado)
        )
    )

    (:action move-pacman-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not (pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?x ?yn)
                    (fantasmaG-up)
                    (fantasmaB-down)
                    (checar-morto-pre)
                )
            )
            (when
                (and (frutaR-em ?x ?yn))
                (and(frutaR-ativa)))
            (when
                (and (frutaG-em ?x ?yn))
                (and(frutaG-ativa)))
            (when
                (and (frutaB-em ?x ?yn))
                (and(frutaB-ativa)))
        )
    )

    (:action move-pacman-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not (pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?x ?yn)
                    (fantasmaB-up)
                    (fantasmaG-down)
                    (checar-morto-pre)
                )
            )
            (when
                (and (frutaR-em ?x ?yn))
                (and(frutaR-ativa)))
            (when
                (and (frutaG-em ?x ?yn))
                (and(frutaG-ativa)))
            (when
                (and (frutaB-em ?x ?yn))
                (and(frutaB-ativa)))
        )
    )

    (:action move-pacman-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?xn ?y)
                    (fantasmaB-right)
                    (fantasmaG-left)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?xn ?y)
                    (fantasmaB-left)
                    (fantasmaG-right)
                    (checar-morto-pre)
                )
            )
            (when
                (and (frutaR-em ?xn ?y))
                (and(frutaR-ativa)))
            (when
                (and (frutaG-em ?xn ?y))
                (and(frutaG-ativa)))
            (when
                (and (frutaB-em ?xn ?y))
                (and(frutaB-ativa)))
        )
    )

    (:action move-fantasmaR-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaR-em ?x ?y) (not(fantasmaR-morto)) (or (fantasmaR-liberado) (fantasmaB-morto)) (fantasmaR-up) (dec ?y ?yn))
        :effect (and
            (when
                (not(parede-em ?x ?yn))
                (and
                    (not(fantasmaR-em ?x ?y))
                    (fantasmaR-em ?x ?yn)
                    (not(fantasmaR-liberado))
                    (fantasmaB-liberado)
                )
            )
            (when
                (parede-em ?x ?yn)
                (and
                    (not(fantasmaR-up))
                    (fantasmaR-right)
                )
            )
        )
    )

    (:action move-fantasmaR-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaR-em ?x ?y) (or (fantasmaR-liberado) (fantasmaB-morto)) (not(fantasmaR-morto)) (fantasmaR-down) (inc ?y ?yn))
        :effect (and
            (when
                (not(parede-em ?x ?yn))
                (and
                    (not(fantasmaR-em ?x ?y))
                    (fantasmaR-em ?x ?yn)
                    (not(fantasmaR-liberado))
                    (fantasmaB-liberado)
                )
            )
            (when
                (parede-em ?x ?yn)
                (and
                    (not(fantasmaR-down))
                    (fantasmaR-left)
                )
            )
        )
    )

    (:action move-fantasmaR-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaR-em ?x ?y) (or (fantasmaR-liberado) (fantasmaB-morto)) (not(fantasmaR-morto)) (fantasmaR-left) (dec ?x ?xn))
        :effect (and
            (when
                (not(parede-em ?xn ?y))
                (and
                    (not(fantasmaR-em ?x ?y))
                    (fantasmaR-em ?xn ?y)
                    (not(fantasmaR-liberado))
                    (fantasmaB-liberado)
                )
            )
            (when
                (parede-em ?xn ?y)
                (and
                    (not(fantasmaR-left))
                    (fantasmaR-up)
                )
            )
        )
    )

    (:action move-fantasmaR-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaR-em ?x ?y) (or (fantasmaR-liberado) (fantasmaB-morto)) (not(fantasmaR-morto)) (fantasmaR-right) (inc ?x ?xn))
        :effect (and
            (when
                (not(parede-em ?xn ?y))
                (and
                    (not(fantasmaR-em ?x ?y))
                    (fantasmaR-em ?xn ?y)
                    (not(fantasmaR-liberado))
                    (fantasmaB-liberado)
                )
            )
            (when
                (parede-em ?xn ?y)
                (and
                    (not(fantasmaR-right))
                    (fantasmaR-down)
                )
            )
        )
    )

    (:action comer-fantasma-red
        :parameters (?px ?py - posicao)
        :precondition (and (pacman-em ?px ?py) (not(fantasmaR-morto)) (fantasmaR-em ?px ?py) (frutaR-ativa))
        :effect (and (fantasmaR-morto) (not(frutaR-ativa)) (not(fantasmaR-em ?px ?py)))
    )

    (:action move-fantasmaB-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (or(fantasmaB-liberado) (fantasmaR-morto)) (not(fantasmaB-morto)) (fantasmaB-up) (dec ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?x ?yn)

                    (not(fantasmaB-liberado))
                    (not(fantasmaB-up))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaB-liberado)) (not(fantasmaB-up)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaB-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (or(fantasmaB-liberado) (fantasmaR-morto)) (not(fantasmaB-morto)) (fantasmaB-down) (inc ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?x ?yn)
                    (not(fantasmaB-liberado))
                    (not(fantasmaB-down))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaB-liberado)) (not(fantasmaB-down)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaB-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (or(fantasmaB-liberado) (fantasmaR-morto)) (not(fantasmaB-morto)) (fantasmaB-left) (dec ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?xn ?y)
                    (not(fantasmaB-liberado))
                    (not(fantasmaB-left))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaB-liberado)) (not(fantasmaB-left)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaB-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (or(fantasmaB-liberado) (fantasmaR-morto)) (not(fantasmaB-morto)) (fantasmaB-right) (inc ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?xn ?y)
                    (not(fantasmaB-liberado))
                    (not(fantasmaB-right))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaB-liberado)) (not(fantasmaB-right)) (checar-morto-pos))
            )
        )
    )

    (:action comer-fantasma-Blue
        :parameters (?px ?py - posicao)
        :precondition (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py) (frutaB-ativa))
        :effect (and (fantasmaB-morto) (not(frutaB-ativa)) (not(fantasmaB-em ?px ?py)))
    )

)

; problem
(define (problem pacman3x3)
    (:domain pacman)
    (:objects
        x1 x2 x3 x4 x5 y1 y2 y3 y4 y5 - posicao
    )
    (:init
        (pacman-liberado)
        (pacman-em x2 y2)

        (fantasmaR-em x4 y4)
        (fantasmaR-right)
        (frutaR-em x3 y3)

        (fantasmaB-em x3 y4)
        (frutaB-em x4 y2)

        (parede-em x1 y1)
        (parede-em x1 y2)
        (parede-em x1 y3)
        (parede-em x1 y4)
        (parede-em x1 y5)
        (parede-em x2 y1)
        (parede-em x2 y5)
        (parede-em x3 y1)
        (parede-em x3 y5)
        (parede-em x4 y1)
        (parede-em x4 y5)
        (parede-em x5 y1)
        (parede-em x5 y2)
        (parede-em x5 y3)
        (parede-em x5 y4)
        (parede-em x5 y5)

        (inc x1 x2)
        (inc x2 x3)
        (inc x3 x4)
        (inc x4 x5)
        (inc y1 y2)
        (inc y2 y3)
        (inc y3 y4)
        (inc y4 y5)
        (dec x5 x4)
        (dec x4 x3)
        (dec x3 x2)
        (dec x2 x1)
        (dec y5 y4)
        (dec y4 y3)
        (dec y3 y2)
        (dec y2 y1)

    )
    (:goal
        (and
            (not(pacman-morto))
            (fantasmaB-morto)
            (fantasmaR-morto)
        )
    )
)

; plan
1. (move-pacman-right x2 y2 x3)
   deleted: (pacman-em x2 y2) (pacman-liberado)
   added: (pacman-em x3 y2) (fantasmab-left) (fantasmag-right) (checar-morto-pre)
   goals met: 1 of 3
2. (checagem-morto-pre x3 y2)
   deleted: (checar-morto-pre)
   added: (fantasmar-liberado)
   goals met: 1 of 3
3. (move-fantasmar-right x4 y4 x5)
   deleted: (fantasmar-right)
   added: (fantasmar-down)
   goals met: 1 of 3
4. (move-fantasmar-down x4 y4 y5)
   deleted: (fantasmar-down)
   added: (fantasmar-left)
   goals met: 1 of 3
5. (move-fantasmar-left x4 y4 x3)
   deleted: (fantasmar-em x4 y4) (fantasmar-liberado)
   added: (fantasmar-em x3 y4) (fantasmab-liberado)
   goals met: 1 of 3
6. (move-fantasmab-left x3 y4 x2)
   deleted: (fantasmab-em x3 y4) (fantasmab-liberado) (fantasmab-left)
   added: (fantasmab-em x2 y4) (checar-morto-pos)
   goals met: 1 of 3
7. (checagem-morto-pos x3 y2)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 3
8. (move-pacman-down x3 y2 y3)
   deleted: (pacman-em x3 y2) (pacman-liberado)
   added: (pacman-em x3 y3) (fantasmab-up) (fantasmag-down) (checar-morto-pre) (frutar-ativa)
   goals met: 1 of 3
9. (checagem-morto-pre x3 y3)
   deleted: (checar-morto-pre)
   added: (fantasmar-liberado)
   goals met: 1 of 3
10. (move-fantasmar-left x3 y4 x2)
   deleted: (fantasmar-em x3 y4) (fantasmar-liberado)
   added: (fantasmar-em x2 y4) (fantasmab-liberado)
   goals met: 1 of 3
11. (move-fantasmab-up x2 y4 y3)
   deleted: (fantasmab-em x2 y4) (fantasmab-liberado) (fantasmab-up)
   added: (fantasmab-em x2 y3) (checar-morto-pos)
   goals met: 1 of 3
12. (checagem-morto-pos x3 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 3
13. (move-pacman-up x3 y3 y2)
   deleted: (pacman-em x3 y3) (pacman-liberado)
   added: (pacman-em x3 y2) (fantasmag-up) (fantasmab-down) (checar-morto-pre)
   goals met: 1 of 3
14. (checagem-morto-pre x3 y2)
   deleted: (checar-morto-pre)
   added: (fantasmar-liberado)
   goals met: 1 of 3
15. (move-fantasmar-left x2 y4 x1)
   deleted: (fantasmar-left)
   added: (fantasmar-up)
   goals met: 1 of 3
16. (move-fantasmar-up x2 y4 y3)
   deleted: (fantasmar-em x2 y4) (fantasmar-liberado)
   added: (fantasmar-em x2 y3) (fantasmab-liberado)
   goals met: 1 of 3
17. (move-fantasmab-down x2 y3 y4)
   deleted: (fantasmab-em x2 y3) (fantasmab-liberado) (fantasmab-down)
   added: (fantasmab-em x2 y4) (checar-morto-pos)
   goals met: 1 of 3
18. (checagem-morto-pos x3 y2)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 3
19. (move-pacman-left x3 y2 x2)
   deleted: (pacman-em x3 y2) (pacman-liberado)
   added: (pacman-em x2 y2) (fantasmab-right) (fantasmag-left) (checar-morto-pre)
   goals met: 1 of 3
20. (checagem-morto-pre x2 y2)
   deleted: (checar-morto-pre)
   added: (fantasmar-liberado)
   goals met: 1 of 3
21. (move-fantasmar-up x2 y3 y2)
   deleted: (fantasmar-em x2 y3) (fantasmar-liberado)
   added: (fantasmar-em x2 y2) (fantasmab-liberado)
   goals met: 1 of 3
22. (comer-fantasma-red x2 y2)
   deleted: (frutar-ativa) (fantasmar-em x2 y2)
   added: (fantasmar-morto)
   goals met: 2 of 3
23. (move-fantasmab-right x2 y4 x3)
   deleted: (fantasmab-em x2 y4) (fantasmab-liberado) (fantasmab-right)
   added: (fantasmab-em x3 y4) (checar-morto-pos)
   goals met: 2 of 3
24. (checagem-morto-pos x2 y2)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 2 of 3
25. (move-pacman-right x2 y2 x3)
   deleted: (pacman-em x2 y2) (pacman-liberado)
   added: (pacman-em x3 y2) (fantasmab-left) (checar-morto-pre)
   goals met: 2 of 3
26. (move-fantasmab-left x3 y4 x2)
   deleted: (fantasmab-em x3 y4) (fantasmab-left)
   added: (fantasmab-em x2 y4) (checar-morto-pos)
   goals met: 2 of 3
27. (checagem-morto-pos x3 y2)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 2 of 3
28. (move-pacman-right x3 y2 x4)
   deleted: (pacman-em x3 y2) (pacman-liberado)
   added: (pacman-em x4 y2) (fantasmab-left) (frutab-ativa)
   goals met: 2 of 3
29. (move-fantasmab-left x2 y4 x1)
   deleted: (fantasmab-left)
   added: (checar-morto-pos)
   goals met: 2 of 3
30. (checagem-morto-pos x4 y2)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 2 of 3
31. (move-pacman-down x4 y2 y3)
   deleted: (pacman-em x4 y2) (pacman-liberado)
   added: (pacman-em x4 y3) (fantasmab-up)
   goals met: 2 of 3
32. (move-fantasmab-up x2 y4 y3)
   deleted: (fantasmab-em x2 y4) (fantasmab-up)
   added: (fantasmab-em x2 y3) (checar-morto-pos)
   goals met: 2 of 3
33. (checagem-morto-pos x4 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 2 of 3
34. (move-pacman-left x4 y3 x3)
   deleted: (pacman-em x4 y3) (pacman-liberado)
   added: (pacman-em x3 y3) (fantasmab-right)
   goals met: 2 of 3
35. (move-fantasmab-right x2 y3 x3)
   deleted: (fantasmab-em x2 y3) (fantasmab-right)
   added: (fantasmab-em x3 y3) (checar-morto-pos)
   goals met: 2 of 3
36. (comer-fantasma-blue x3 y3)
   deleted: (frutab-ativa) (fantasmab-em x3 y3)
   added: (fantasmab-morto)
   goals met: 3 of 3
